app/views/players/_form.html.erb

SELECT "teams".* FROM "teams"
---
    <%= form.label :team_id %>
    <%= form.select :team_id,options_for_select(Team.all.map{|t|[t.name, t.id]}), class: "block shadow rounded-md border border-gray-200 outline-none px-3 py-2 mt-2 w-full" %>