app/views/matches/_form.html.erb

SELECT "teams".* FROM "teams"
---
    <%= form.label :team_1_id %>
    <%= form.select :team_1_id, options_for_select(Team.all.map{|s|[s.name, s.id]}), class: "block shadow rounded-md border border-gray-200 outline-none px-3 py-2 mt-2 w-full" %>

SELECT "teams".* FROM "teams"
---
    <%= form.label :team_2_id %>
    <%= form.select :team_2_id, options_for_select(Team.all.map{|s|[s.name, s.id]}), class: "block shadow rounded-md border border-gray-200 outline-none px-3 py-2 mt-2 w-full" %>