app/controllers/matches_controller.rb

  def destroy
    @tournament = Tournament.find(params[:tournament_id])
    @match = @tournament.match.find(params[:id])
    @match.destroy
---
DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 3]]