app/controllers/matches_controller.rb

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def index
    @tournament = Tournament.find(params[:tournament_id])

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."tournament_id" = $1 AND "matches"."id" = $2 LIMIT $3  [["tournament_id", 6], ["id", 1], ["LIMIT", 1]]
SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "score_records".* FROM "score_records" WHERE "score_records"."match_id" = $1 AND "score_records"."team_id" = $2 ORDER BY "score_records"."id" ASC LIMIT $3  [["match_id", 1], ["team_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "score_records" WHERE "score_records"."match_id" = $1 AND "score_records"."team_id" = $2  [["match_id", 1], ["team_id", 1]]
SELECT "score_records".* FROM "score_records" WHERE "score_records"."match_id" = $1 AND (2)  [["match_id", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @tournament = Tournament.find(params[:tournament_id])
    @match = @tournament.match.find(params[:id])
    @team_1_scores = @match.score_records

    @team_1_scores = @match.score_records.where(team_id: @match.team_1_id)
    @team_2_scores = @match.score_records.where(team_id: @match.team_2_id)

    @team_1_total = @team_1_scores.sum(:goals)
    @team_2_total = @team_2_scores.sum(:goals)

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def new
    @tournament = Tournament.find(params[:tournament_id])

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "matches" ("date", "tournament_id", "created_at", "updated_at", "team_1_id", "team_2_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2022-09-14 14:46:00"], ["tournament_id", 16], ["created_at", "2022-09-26 09:46:33.838605"], ["updated_at", "2022-09-26 09:46:33.838605"], ["team_1_id", 2], ["team_2_id", 1]]
UPDATE "matches" SET "date" = $1, "updated_at" = $2, "team_2_id" = $3 WHERE "matches"."id" = $4  [["date", "2022-09-16 14:46:00"], ["updated_at", "2022-09-26 09:57:10.700923"], ["team_2_id", 1], ["id", 2]]
---
  def create
    @tournament = Tournament.find(params[:tournament_id])
    @match = @tournament.match.create(match_params)
    @match.save

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."tournament_id" = $1 AND "matches"."id" = $2 LIMIT $3  [["tournament_id", 16], ["id", 3], ["LIMIT", 1]]
UPDATE "matches" SET "date" = $1, "updated_at" = $2, "team_2_id" = $3 WHERE "matches"."id" = $4  [["date", "2022-09-15 14:46:00"], ["updated_at", "2022-09-26 09:53:41.501895"], ["team_2_id", 2], ["id", 2]]
---
  def update
    @tournament = Tournament.find(params[:tournament_id])
    @match = @tournament.match.find(params[:id]) #.update(match_params)
    @match.update(match_params)

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."tournament_id" = $1 AND "matches"."id" = $2 LIMIT $3  [["tournament_id", 6], ["id", 1], ["LIMIT", 1]]
DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 1]]
---
  def destroy
    @tournament = Tournament.find(params[:tournament_id])
    @match = @tournament.match.find(params[:id])
    @match.destroy