app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
  def index
    query = params[:q]
    if query and not query.empty?
      @players = Player.where("name = ? or country = ?", query, query)
    else
      @players = Player.all