app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
  def index
    @team = Team.all

SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "teams" SET "name" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["name", "NRG - 1"], ["updated_at", "2022-09-26 05:18:17.621971"], ["id", 1]]
---
  def update
    @team = Team.find(params[:id])

    if @team.update(team_params)