app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def index
    @tournaments = Tournament.all

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    @tournament = Tournament.find(params[:id])

INSERT INTO "tournaments" ("title", "location", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", ""], ["location", ""], ["start_date", "2022-09-22"], ["end_date", "2022-09-22"], ["created_at", "2022-09-22 09:06:52.969413"], ["updated_at", "2022-09-22 09:06:52.969413"]]
---
  def create
    @tournament = Tournament.new(article_params)

    if @tournament.save

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @tournament = Tournament.find(params[:id])

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "tournaments" SET "location" = $1, "updated_at" = $2 WHERE "tournaments"."id" = $3  [["location", "PAKistan"], ["updated_at", "2022-09-22 10:23:40.883776"], ["id", 14]]
---
  def update
    @tournament = Tournament.find(params[:id])

    if @tournament.update(article_params)

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "tournaments" WHERE "tournaments"."id" = $1  [["id", 4]]
---
  def destroy
    @tournament = Tournament.find(params[:id])
    @tournament.destroy